
function initDatepicker(){
    
    $(function(){
                $("#datepicker").datepicker({ 'dateFormat': 'yy-mm-dd',
                                              'dayNames': ['воскресенье', 'понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота'],
                                              'dayNamesMin': ['вс', 'пн', 'вт', 'ср', 'чт', 'пт', 'сб'],
                                              'monthNames': ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь'],
                                              'firstDay': 1,
                                              //'autoSize': 'true'
                                              });
        });
}

function initDateEditor(){
    
    $(function(){
                $("#editDate").datepicker({ 'dateFormat': 'yy-mm-dd',
                                              'dayNames': ['воскресенье', 'понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота'],
                                              'dayNamesMin': ['вс', 'пн', 'вт', 'ср', 'чт', 'пт', 'сб'],
                                              'monthNames': ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь'],
                                              'firstDay': 1,
                                              //'autoSize': 'true'
                                              });
        });
}


